## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| recreate | `aws_iam_policy.ai-answers-ssm-policy`            |
|          | `aws_iam_policy_attachment.ai-answers-ssm-policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.ai-answers-ssm-policy must be replaced
-/+ resource "aws_iam_policy" "ai-answers-ssm-policy" {
      ~ arn              = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Policy for AI Answers to access SSM parameters" -> "Policy for ai-answers staging to access SSM parameters" # forces replacement
      ~ id               = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply)
        name             = "ai-answers-ssm-policy"
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPA6ODU7SBIQOCZ6UOT2" -> (known after apply)
        tags             = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy_attachment.ai-answers-ssm-policy must be replaced
-/+ resource "aws_iam_policy_attachment" "ai-answers-ssm-policy" {
      - groups     = [] -> null
      ~ id         = "ai-answers-ssm-policy" -> (known after apply)
        name       = "ai-answers-ssm-policy"
      ~ policy_arn = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply) # forces replacement
      - users      = [] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
